---
type: ExportLayerKey
namespace: Autodesk.Revit.DB
version: 2024
members: 7
tags: [revit-api, class]
---

# ExportLayerKey

`Autodesk.Revit.DB.ExportLayerKey` · Revit 2024 · 7 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | ExportLayerKey | — | `` |
| Constructor | ExportLayerKey | 2014 | `public ExportLayerKey ()` |
| Method | Dispose | — | `public void Dispose ()` |
| Property | CategoryName | 2014 | `public string CategoryName { get ; set ; }` |
| Property | IsValidObject | 2014 | `public bool IsValidObject { get ; }` |
| Property | SpecialType | 2014 | `public SpecialType SpecialType { get ; set ; }` |
| Property | SubCategoryName | 2014 | `public string SubCategoryName { get ; set ; }` |